struct DhGroupElement{N} <: AbstractCGroupElement{N}
    sym::Symbol
    inv::Symbol
    group_rep::Symbol

    function DhGroupElement{N}(sym, inv, grep) where N
        new{N}(sym, inv, grep)
    end
end

struct DhGroup{N} <:AbstractCGroup{N}
    sym::Symbol
    elements::LittleDict{Symbol, Symbol}
    idxdict::Dict{Symbol, Int64}
    mtable::Matrix{Symbol}
    function DhGroup{N}() where N
        if N == 2
            els = LittleDict(
                :E => :E,
                :C21 => :C21,
                :σ1 => :σ1,
                :σ2 => :σ2,
                :σh => :σh,
                :i => :i,
                :σ1i => :σ1i,
                :σ2i => :σ2i
            )
            M = [ :E :C21 :σ1 :σ2 :σh :i :σ1i :σ2i ;
                :C21 :E :σ2 :σ1 :i :σh :σ2i :σ1i ;
                :σ1 :σ2 :E :C21 :σ2i :σ1i :i :σh ;
                :σ2 :σ1 :C21 :E :σ1i :σ2i :σh :i ;
                :σh :i :σ2i :σ1i :E :C21 :σ2 :σ1 ;
                :i :σh :σ1i :σ2i :C21 :E :σ1 :σ2 ;
                :σ1i :σ2i :i :σh :σ2 :σ1 :E :C21 ;
                :σ2i :σ1i :σh :i :σ1 :σ2 :C21 :E]

        elseif N == 3
            els = LittleDict(
                :E => :E,
                :C31 => :C32,
                :C32 => :C31,
                :σ1 => :σ1,
                :σ2 => :σ2,
                :σ3 => :σ3,
                :σh => :σh,
                :S31 => :S32,
                :S32 => :S31,
                :σ1σh => :σ1σh,
                :σ2σh => :σ2σh,
                :σ3σh => :σ3σh
                            )
                M = [ :E :C31 :C32 :σ1 :σ2 :σ3 :σh :S31 :S32 :σ1σh :σ2σh :σ3σh ;
                    :C31 :C32 :E :σ3 :σ1 :σ2 :S31 :S32 :σh :σ3σh :σ1σh :σ2σh ;
                    :C32 :E :C31 :σ2 :σ3 :σ1 :S32 :σh :S31 :σ2σh :σ3σh :σ1σh ;
                    :σ1 :σ2 :σ3 :E :C31 :C32 :σ1σh :σ2σh :σ3σh :σh :S31 :S32 ;
                    :σ2 :σ3 :σ1 :C32 :E :C31 :σ2σh :σ3σh :σ1σh :S32 :σh :S31 ;
                    :σ3 :σ1 :σ2 :C31 :C32 :E :σ3σh :σ1σh :σ2σh :S31 :S32 :σh ;
                    :σh :S31 :S32 :σ1σh :σ2σh :σ3σh :E :C31 :C32 :σ1 :σ2 :σ3 ;
                    :S31 :S32 :σh :σ3σh :σ1σh :σ2σh :C31 :C32 :E :σ3 :σ1 :σ2 ;
                    :S32 :σh :S31 :σ2σh :σ3σh :σ1σh :C32 :E :C31 :σ2 :σ3 :σ1 ;
                    :σ1σh :σ2σh :σ3σh :σh :S31 :S32 :σ1 :σ2 :σ3 :E :C31 :C32 ;
                    :σ2σh :σ3σh :σ1σh :S32 :σh :S31 :σ2 :σ3 :σ1 :C32 :E :C31 ;
                    :σ3σh :σ1σh :σ2σh :S31 :S32 :σh :σ3 :σ1 :σ2 :C31 :C32 :E]
        elseif N == 4
            els = LittleDict(
                :E => :E,
                :C41 => :C43,
                :C21 => :C21,
                :C43 => :C41,
                :σ1 => :σ1,
                :σ2 => :σ2,
                :σ3 => :σ3,
                :σ4 => :σ4,
                :σh => :σh,
                :S41 => :S43,
                :S21 => :S21,
                :S43 => :S41,
                :σ1σh => :σ1σh,
                :σ2σh => :σ2σh,
                :σ3σh => :σ3σh,
                :σ4σh => :σ4σh
            )
            M = [ :E :C41 :C21 :C43 :σ1 :σ2 :σ3 :σ4 :σh :S41 :S21 :S43 :σ1σh :σ2σh :σ3σh :σ4σh ;
                :C41 :C21 :C43 :E :σ4 :σ1 :σ2 :σ3 :S41 :S21 :S43 :σh :σ4σh :σ1σh :σ2σh :σ3σh ;
                :C21 :C43 :E :C41 :σ3 :σ4 :σ1 :σ2 :S21 :S43 :σh :S41 :σ3σh :σ4σh :σ1σh :σ2σh ;
                :C43 :E :C41 :C21 :σ2 :σ3 :σ4 :σ1 :S43 :σh :S41 :S21 :σ2σh :σ3σh :σ4σh :σ1σh ;
                :σ1 :σ2 :σ3 :σ4 :E :C41 :C21 :C43 :σ1σh :σ2σh :σ3σh :σ4σh :σh :S41 :S21 :S43 ;
                :σ2 :σ3 :σ4 :σ1 :C43 :E :C41 :C21 :σ2σh :σ3σh :σ4σh :σ1σh :S43 :σh :S41 :S21 ;
                :σ3 :σ4 :σ1 :σ2 :C21 :C43 :E :C41 :σ3σh :σ4σh :σ1σh :σ2σh :S21 :S43 :σh :S41 ;
                :σ4 :σ1 :σ2 :σ3 :C41 :C21 :C43 :E :σ4σh :σ1σh :σ2σh :σ3σh :S41 :S21 :S43 :σh ;
                :σh :S41 :S21 :S43 :σ1σh :σ2σh :σ3σh :σ4σh :E :C41 :C21 :C43 :σ1 :σ2 :σ3 :σ4 ;
                :S41 :S21 :S43 :σh :σ4σh :σ1σh :σ2σh :σ3σh :C41 :C21 :C43 :E :σ4 :σ1 :σ2 :σ3 ;
                :S21 :S43 :σh :S41 :σ3σh :σ4σh :σ1σh :σ2σh :C21 :C43 :E :C41 :σ3 :σ4 :σ1 :σ2 ;
                :S43 :σh :S41 :S21 :σ2σh :σ3σh :σ4σh :σ1σh :C43 :E :C41 :C21 :σ2 :σ3 :σ4 :σ1 ;
                :σ1σh :σ2σh :σ3σh :σ4σh :σh :S41 :S21 :S43 :σ1 :σ2 :σ3 :σ4 :E :C41 :C21 :C43 ;
                :σ2σh :σ3σh :σ4σh :σ1σh :S43 :σh :S41 :S21 :σ2 :σ3 :σ4 :σ1 :C43 :E :C41 :C21 ;
                :σ3σh :σ4σh :σ1σh :σ2σh :S21 :S43 :σh :S41 :σ3 :σ4 :σ1 :σ2 :C21 :C43 :E :C41 ;
                :σ4σh :σ1σh :σ2σh :σ3σh :S41 :S21 :S43 :σh :σ4 :σ1 :σ2 :σ3 :C41 :C21 :C43 :E]
        elseif N == 5
             els = LittleDict(
                :E => :E,
                :C51 => :C54,
                :C52 => :C53,
                :C53 => :C52,
                :C54 => :C51,
                :σ1 => :σ1,
                :σ2 => :σ2,
                :σ3 => :σ3,
                :σ4 => :σ4,
                :σ5 => :σ5,
                :σh => :σh,
                :S51 => :S54,
                :S52 => :S53,
                :S53 => :S52,
                :S54 => :S51,
                :σ1σh => :σ1σh,
                :σ2σh => :σ2σh,
                :σ3σh => :σ3σh,
                :σ4σh => :σ4σh,
                :σ5σh => :σ5σh
                        )        
            M = [ :E :C51 :C52 :C53 :C54 :σ1 :σ2 :σ3 :σ4 :σ5 :σh :S51 :S52 :S53 :S54 :σ1σh :σ2σh :σ3σh :σ4σh :σ5σh ;
                :C51 :C52 :C53 :C54 :E :σ5 :σ1 :σ2 :σ3 :σ4 :S51 :S52 :S53 :S54 :σh :σ5σh :σ1σh :σ2σh :σ3σh :σ4σh ;
                :C52 :C53 :C54 :E :C51 :σ4 :σ5 :σ1 :σ2 :σ3 :S52 :S53 :S54 :σh :S51 :σ4σh :σ5σh :σ1σh :σ2σh :σ3σh ;
                :C53 :C54 :E :C51 :C52 :σ3 :σ4 :σ5 :σ1 :σ2 :S53 :S54 :σh :S51 :S52 :σ3σh :σ4σh :σ5σh :σ1σh :σ2σh ;
                :C54 :E :C51 :C52 :C53 :σ2 :σ3 :σ4 :σ5 :σ1 :S54 :σh :S51 :S52 :S53 :σ2σh :σ3σh :σ4σh :σ5σh :σ1σh ;
                :σ1 :σ2 :σ3 :σ4 :σ5 :E :C51 :C52 :C53 :C54 :σ1σh :σ2σh :σ3σh :σ4σh :σ5σh :σh :S51 :S52 :S53 :S54 ;
                :σ2 :σ3 :σ4 :σ5 :σ1 :C54 :E :C51 :C52 :C53 :σ2σh :σ3σh :σ4σh :σ5σh :σ1σh :S54 :σh :S51 :S52 :S53 ;
                :σ3 :σ4 :σ5 :σ1 :σ2 :C53 :C54 :E :C51 :C52 :σ3σh :σ4σh :σ5σh :σ1σh :σ2σh :S53 :S54 :σh :S51 :S52 ;
                :σ4 :σ5 :σ1 :σ2 :σ3 :C52 :C53 :C54 :E :C51 :σ4σh :σ5σh :σ1σh :σ2σh :σ3σh :S52 :S53 :S54 :σh :S51 ;
                :σ5 :σ1 :σ2 :σ3 :σ4 :C51 :C52 :C53 :C54 :E :σ5σh :σ1σh :σ2σh :σ3σh :σ4σh :S51 :S52 :S53 :S54 :σh ;
                :σh :S51 :S52 :S53 :S54 :σ1σh :σ2σh :σ3σh :σ4σh :σ5σh :E :C51 :C52 :C53 :C54 :σ1 :σ2 :σ3 :σ4 :σ5 ;
                :S51 :S52 :S53 :S54 :σh :σ5σh :σ1σh :σ2σh :σ3σh :σ4σh :C51 :C52 :C53 :C54 :E :σ5 :σ1 :σ2 :σ3 :σ4 ;
                :S52 :S53 :S54 :σh :S51 :σ4σh :σ5σh :σ1σh :σ2σh :σ3σh :C52 :C53 :C54 :E :C51 :σ4 :σ5 :σ1 :σ2 :σ3 ;
                :S53 :S54 :σh :S51 :S52 :σ3σh :σ4σh :σ5σh :σ1σh :σ2σh :C53 :C54 :E :C51 :C52 :σ3 :σ4 :σ5 :σ1 :σ2 ;
                :S54 :σh :S51 :S52 :S53 :σ2σh :σ3σh :σ4σh :σ5σh :σ1σh :C54 :E :C51 :C52 :C53 :σ2 :σ3 :σ4 :σ5 :σ1 ;
                :σ1σh :σ2σh :σ3σh :σ4σh :σ5σh :σh :S51 :S52 :S53 :S54 :σ1 :σ2 :σ3 :σ4 :σ5 :E :C51 :C52 :C53 :C54 ;
                :σ2σh :σ3σh :σ4σh :σ5σh :σ1σh :S54 :σh :S51 :S52 :S53 :σ2 :σ3 :σ4 :σ5 :σ1 :C54 :E :C51 :C52 :C53 ;
                :σ3σh :σ4σh :σ5σh :σ1σh :σ2σh :S53 :S54 :σh :S51 :S52 :σ3 :σ4 :σ5 :σ1 :σ2 :C53 :C54 :E :C51 :C52 ;
                :σ4σh :σ5σh :σ1σh :σ2σh :σ3σh :S52 :S53 :S54 :σh :S51 :σ4 :σ5 :σ1 :σ2 :σ3 :C52 :C53 :C54 :E :C51 ;
                :σ5σh :σ1σh :σ2σh :σ3σh :σ4σh :S51 :S52 :S53 :S54 :σh :σ5 :σ1 :σ2 :σ3 :σ4 :C51 :C52 :C53 :C54 :E]
        elseif N == 6
            els = LittleDict(
                :E => :E,
                :C61 => :C65,
                :C31 => :C32,
                :C21 => :C21,
                :C32 => :C31,
                :C65 => :C61,
                :σ1 => :σ1,
                :σ2 => :σ2,
                :σ3 => :σ3,
                :σ4 => :σ4,
                :σ5 => :σ5,
                :σ6 => :σ6,
                :σh => :σh,
                :S61 => :S65,
                :S31 => :S32,
                :S21 => :S21,
                :S32 => :S31,
                :S65 => :S61,
                :σ1σh => :σ1σh,
                :σ2σh => :σ2σh,
                :σ3σh => :σ3σh,
                :σ4σh => :σ4σh,
                :σ5σh => :σ5σh,
                :σ6σh => :σ6σh
                        )
            M = [ :E :C61 :C31 :C21 :C32 :C65 :σ1 :σ2 :σ3 :σ4 :σ5 :σ6 :σh :S61 :S31 :S21 :S32 :S65 :σ1σh :σ2σh :σ3σh :σ4σh :σ5σh :σ6σh ;
                :C61 :C31 :C21 :C32 :C65 :E :σ6 :σ1 :σ2 :σ3 :σ4 :σ5 :S61 :S31 :S21 :S32 :S65 :σh :σ6σh :σ1σh :σ2σh :σ3σh :σ4σh :σ5σh ;
                :C31 :C21 :C32 :C65 :E :C61 :σ5 :σ6 :σ1 :σ2 :σ3 :σ4 :S31 :S21 :S32 :S65 :σh :S61 :σ5σh :σ6σh :σ1σh :σ2σh :σ3σh :σ4σh ;
                :C21 :C32 :C65 :E :C61 :C31 :σ4 :σ5 :σ6 :σ1 :σ2 :σ3 :S21 :S32 :S65 :σh :S61 :S31 :σ4σh :σ5σh :σ6σh :σ1σh :σ2σh :σ3σh ;
                :C32 :C65 :E :C61 :C31 :C21 :σ3 :σ4 :σ5 :σ6 :σ1 :σ2 :S32 :S65 :σh :S61 :S31 :S21 :σ3σh :σ4σh :σ5σh :σ6σh :σ1σh :σ2σh ;
                :C65 :E :C61 :C31 :C21 :C32 :σ2 :σ3 :σ4 :σ5 :σ6 :σ1 :S65 :σh :S61 :S31 :S21 :S32 :σ2σh :σ3σh :σ4σh :σ5σh :σ6σh :σ1σh ;
                :σ1 :σ2 :σ3 :σ4 :σ5 :σ6 :E :C61 :C31 :C21 :C32 :C65 :σ1σh :σ2σh :σ3σh :σ4σh :σ5σh :σ6σh :σh :S61 :S31 :S21 :S32 :S65 ;
                :σ2 :σ3 :σ4 :σ5 :σ6 :σ1 :C65 :E :C61 :C31 :C21 :C32 :σ2σh :σ3σh :σ4σh :σ5σh :σ6σh :σ1σh :S65 :σh :S61 :S31 :S21 :S32 ;
                :σ3 :σ4 :σ5 :σ6 :σ1 :σ2 :C32 :C65 :E :C61 :C31 :C21 :σ3σh :σ4σh :σ5σh :σ6σh :σ1σh :σ2σh :S32 :S65 :σh :S61 :S31 :S21 ;
                :σ4 :σ5 :σ6 :σ1 :σ2 :σ3 :C21 :C32 :C65 :E :C61 :C31 :σ4σh :σ5σh :σ6σh :σ1σh :σ2σh :σ3σh :S21 :S32 :S65 :σh :S61 :S31 ;
                :σ5 :σ6 :σ1 :σ2 :σ3 :σ4 :C31 :C21 :C32 :C65 :E :C61 :σ5σh :σ6σh :σ1σh :σ2σh :σ3σh :σ4σh :S31 :S21 :S32 :S65 :σh :S61 ;
                :σ6 :σ1 :σ2 :σ3 :σ4 :σ5 :C61 :C31 :C21 :C32 :C65 :E :σ6σh :σ1σh :σ2σh :σ3σh :σ4σh :σ5σh :S61 :S31 :S21 :S32 :S65 :σh ;
                :σh :S61 :S31 :S21 :S32 :S65 :σ1σh :σ2σh :σ3σh :σ4σh :σ5σh :σ6σh :E :C61 :C31 :C21 :C32 :C65 :σ1 :σ2 :σ3 :σ4 :σ5 :σ6 ;
                :S61 :S31 :S21 :S32 :S65 :σh :σ6σh :σ1σh :σ2σh :σ3σh :σ4σh :σ5σh :C61 :C31 :C21 :C32 :C65 :E :σ6 :σ1 :σ2 :σ3 :σ4 :σ5 ;
                :S31 :S21 :S32 :S65 :σh :S61 :σ5σh :σ6σh :σ1σh :σ2σh :σ3σh :σ4σh :C31 :C21 :C32 :C65 :E :C61 :σ5 :σ6 :σ1 :σ2 :σ3 :σ4 ;
                :S21 :S32 :S65 :σh :S61 :S31 :σ4σh :σ5σh :σ6σh :σ1σh :σ2σh :σ3σh :C21 :C32 :C65 :E :C61 :C31 :σ4 :σ5 :σ6 :σ1 :σ2 :σ3 ;
                :S32 :S65 :σh :S61 :S31 :S21 :σ3σh :σ4σh :σ5σh :σ6σh :σ1σh :σ2σh :C32 :C65 :E :C61 :C31 :C21 :σ3 :σ4 :σ5 :σ6 :σ1 :σ2 ;
                :S65 :σh :S61 :S31 :S21 :S32 :σ2σh :σ3σh :σ4σh :σ5σh :σ6σh :σ1σh :C65 :E :C61 :C31 :C21 :C32 :σ2 :σ3 :σ4 :σ5 :σ6 :σ1 ;
                :σ1σh :σ2σh :σ3σh :σ4σh :σ5σh :σ6σh :σh :S61 :S31 :S21 :S32 :S65 :σ1 :σ2 :σ3 :σ4 :σ5 :σ6 :E :C61 :C31 :C21 :C32 :C65 ;
                :σ2σh :σ3σh :σ4σh :σ5σh :σ6σh :σ1σh :S65 :σh :S61 :S31 :S21 :S32 :σ2 :σ3 :σ4 :σ5 :σ6 :σ1 :C65 :E :C61 :C31 :C21 :C32 ;
                :σ3σh :σ4σh :σ5σh :σ6σh :σ1σh :σ2σh :S32 :S65 :σh :S61 :S31 :S21 :σ3 :σ4 :σ5 :σ6 :σ1 :σ2 :C32 :C65 :E :C61 :C31 :C21 ;
                :σ4σh :σ5σh :σ6σh :σ1σh :σ2σh :σ3σh :S21 :S32 :S65 :σh :S61 :S31 :σ4 :σ5 :σ6 :σ1 :σ2 :σ3 :C21 :C32 :C65 :E :C61 :C31 ;
                :σ5σh :σ6σh :σ1σh :σ2σh :σ3σh :σ4σh :S31 :S21 :S32 :S65 :σh :S61 :σ5 :σ6 :σ1 :σ2 :σ3 :σ4 :C31 :C21 :C32 :C65 :E :C61 ;
                :σ6σh :σ1σh :σ2σh :σ3σh :σ4σh :σ5σh :S61 :S31 :S21 :S32 :S65 :σh :σ6 :σ1 :σ2 :σ3 :σ4 :σ5 :C61 :C31 :C21 :C32 :C65 :E]
        end


        _idd = Dict([(k => id) for (id, k) in enumerate(keys(els))])
        return new{N}(Symbol("D$(N)h"), els, _idd, M)
    end
end

DhGroup(N) = DhGroup{N}()

function (p::DhGroup{N})(s::Symbol) where N
    return DhGroupElement{N}(s, p.elements[s], p.sym)
end
